src/WinRMSharp.Tests/Data/Sessions/ProtocolOpenCloseShell.yml

- Request:
    Method: POST
    Url: https://127.0.0.1:5986/wsman
    Headers: {}
    Body: >-
      <?xml version="1.0" encoding="utf-16"?>

      <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
        <env:Header>
          <a:To>http://windows-host:5985/wsman</a:To>
          <a:ReplyTo>
            <a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
          </a:ReplyTo>
          <w:MaxEnvelopeSize a:mustUnderstand="true">153600</w:MaxEnvelopeSize>
          <a:MessageID>uuid:00000000-0000-0000-0000-000000000000</a:MessageID>
          <w:Locale a:mustUnderstand="false" xml:lang="en-US" />
          <p:DataLocale a:mustUnderstand="false" xml:lang="en-US" />
          <w:OperationTimeout>PT5S</w:OperationTimeout>
          <w:ResourceURI a:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
          <a:Action mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Create</a:Action>
          <w:OptionSet />
        </env:Header>
        <env:Body>
          <rsp:Shell>
            <rsp:InputStreams>stdin</rsp:InputStreams>
            <rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
          </rsp:Shell>
        </env:Body>
      </env:Envelope>
  Response:
    StatusCode: 200
    Headers:
      Server: Microsoft-HTTPAPI/2.0
      Date: Fri, 16 Dec 2022 23:58:24 GMT
    Body: >-
      <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <s:Header>
          <a:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/CreateResponse</a:Action>
          <a:MessageID>uuid:3BF51F2E-EE37-4F0F-9DFF-29726C7E4BB0</a:MessageID>
          <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
          <a:RelatesTo>uuid:00000000-0000-0000-0000-000000000000</a:RelatesTo>
        </s:Header>
        <s:Body>
          <x:ResourceCreated>
            <a:Address>http://windows-host:5985/wsman</a:Address>
            <a:ReferenceParameters>
              <w:ResourceURI>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
              <w:SelectorSet>
                <w:Selector Name="ShellId">8552200B-8CA3-4FF5-8236-3384D727C7F4</w:Selector>
              </w:SelectorSet>
            </a:ReferenceParameters>
          </x:ResourceCreated>
          <rsp:Shell xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell">
            <rsp:ShellId>8552200B-8CA3-4FF5-8236-3384D727C7F4</rsp:ShellId>
            <rsp:ResourceUri>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</rsp:ResourceUri>
            <rsp:Owner>winrm-vm-003\Default</rsp:Owner>
            <rsp:ClientIP>73.53.37.241</rsp:ClientIP>
            <rsp:IdleTimeOut>PT7200.000S</rsp:IdleTimeOut>
            <rsp:InputStreams>stdin</rsp:InputStreams>
            <rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
            <rsp:ShellRunTime>P0DT0H0M0S</rsp:ShellRunTime>
            <rsp:ShellInactivity>P0DT0H0M0S</rsp:ShellInactivity>
          </rsp:Shell>
        </s:Body>
      </s:Envelope>
- Request:
    Method: POST
    Url: https://127.0.0.1:5986/wsman
    Headers: {}
    Body: >-
      <?xml version="1.0" encoding="utf-16"?>

      <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
        <env:Header>
          <a:To>http://windows-host:5985/wsman</a:To>
          <a:ReplyTo>
            <a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
          </a:ReplyTo>
          <w:MaxEnvelopeSize a:mustUnderstand="true">153600</w:MaxEnvelopeSize>
          <a:MessageID>uuid:00000000-0000-0000-0000-000000000001</a:MessageID>
          <w:Locale a:mustUnderstand="false" xml:lang="en-US" />
          <p:DataLocale a:mustUnderstand="false" xml:lang="en-US" />
          <w:OperationTimeout>PT5S</w:OperationTimeout>
          <w:ResourceURI a:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
          <a:Action mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Delete</a:Action>
          <w:SelectorSet>
            <w:Selector Name="ShellId">8552200B-8CA3-4FF5-8236-3384D727C7F4</w:Selector>
          </w:SelectorSet>
        </env:Header>
        <env:Body />
      </env:Envelope>
  Response:
    StatusCode: 200
    Headers:
      Server: Microsoft-HTTPAPI/2.0
      Date: Fri, 16 Dec 2022 23:58:24 GMT
    Body: >-
      <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <s:Header>
          <a:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/DeleteResponse</a:Action>
          <a:MessageID>uuid:D91F49A9-5112-4ECF-8BD8-59A9FBC490B4</a:MessageID>
          <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
          <a:RelatesTo>uuid:00000000-0000-0000-0000-000000000001</a:RelatesTo>
        </s:Header>
        <s:Body></s:Body>
      </s:Envelope>
